literate.org
#+title: microLogic
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-light.min.css" />

* Introduction
This is a literate implementation of miniKanren, a logic programming
system.  It's meant to be an introduction to the inner workings of
miniKanren and and of core.logic.

For maximum enjoyment, the reader should be familiar with Clojure, and
in particular with protocols. In lieu of that, basic understanding of
lisp syntax and a read through something like
http://clojure-doc.org/articles/language/polymorphism.html should be
sufficient.

This code was derived substantially from microKanren; for more
information, see the bibliography at the end.

* Relational core
** COMMENT Header
#+begin_src clojure :tangle "src/micro_logic/core.clj" :noweb yes :comments org
  (ns micro-logic.core
    (:require [micro-logic.protocols :refer :all]))
#+end_src

** Logic Variables
The purpose of a logic program is to takes an expression with some
unknowns in it and try to find values for those unknowns. Here's an
example logic program in English with an unknown /x/:

#+begin_quote
  Either x is the beginning of the list ["banana", "orange", "apple"],
  or x is the number 1.
#+end_quote

(The two values of /x/ that make this expression succeed are ~1~ and ~banana~)

These unknowns are called /logic variables/, or /lvars/ for
short. Since we're going to write our logic programs in Clojure, we
need a way to represent them.

#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (defrecord LVar [id])
  (defn lvar [id] (LVar. id))
  (defn lvar? [x] (instance? LVar x))
#+end_src

An lvar's /id/ could be anything, but we use it like a serial
number. The first lvar gets created with id 0, the next with id 1, and
so on. There is some special syntax to help with that, which we'll see
below.

** Substitutions and Walking
Once we have determined a value for an lvar, we put it into a
substitution map (/s-map/ for short). This is a regular clojure
hash-map with an lvar as a key. For example,

#+begin_src clojure
  { (lvar 0) "banana" }
#+end_src

is a substitution map that makes the above example succeed (as long as
/x/ is lvar 0).

There is one twist to the substitution map: lvars can be values, as
well.  (This is called a /triangular/ substitution) Here is an example
whose solution is a triangular substitution:

#+begin_quote
  Either x is the beginning of the list [y, "orange", "apple"], or x
  is the number 1.

  y is the string "banana".
#+end_quote

One substitution map which will make this example succeed is
#+begin_src clojure
  { (lvar 0) (lvar 1)
    (lvar 1) "banana" }
#+end_src

We define two operations on the substitution map. The first is for
adding add new entries.
#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (defn add-substitution [s-map lvar value]
    (when s-map
      (assoc s-map lvar value)))
#+end_src

If you try to add something to a ~nil~ substitution map, we just
return ~nil~. The ~nil~ substitution map is output when there are no
substitutions that can make an expression succeed. We'll see where
this is important when we start to build up substitution maps.

The other operation on a substitution map is to look things up. It's just
a hash-map, so why don't we just use the ~get~ function for this? Two reasons:

 - If there is an lvar on the right-hand side, we need to look up that
   value, following them until we get to a non-lvar.

 - The ~walk~ function really means "give me the value of object,
   given this substitution map". So if you walk with a value that's
   not an lvar, it should just give you that value back.

#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (extend-protocol IWalk
    LVar
    (walk [u s-map] (if-let [val (get s-map u)]
                      (recur val s-map)
                      u))
    Object
    (walk [u s-map] u)

    nil
    (walk [u s-map] nil))
#+end_src

Here are some example ~walk~ invocations:
#+begin_src clojure
  > (def s-map { (lvar 0) (lvar 1)
                 (lvar 1) "banana" })

  > (walk (lvar 0) s-map)
  "banana"

  > (walk (lvar 1) s-map)
  "banana"

  > (walk "mango" s-map)
  "mango"
#+end_src


You might notice that it is easy to construct a substitution map with
a loop in it: ~(walk a {a b, b a})~ will not terminate. Most implementations
would handle that with a check in ~add-substitution~, but we omit it here
for simplicity. (it's typically called ~occurs-check~)

