literate.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>microLogic</title>
<!-- 2014-12-30 Tue 10:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Russell Mull" />
<link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-light.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">microLogic</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Relational core</a>
<ul>
<li><a href="#sec-2-1">2.1. Logic Variables</a></li>
<li><a href="#sec-2-2">2.2. Substitutions and Walking</a></li>
<li><a href="#sec-2-3">2.3. Unification</a></li>
<li><a href="#sec-2-4">2.4. Lazy Streams</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1. The definition of a logic program</a></li>
<li><a href="#sec-2-4-2">2.4.2. Definition of a lazy stream</a></li>
<li><a href="#sec-2-4-3">2.4.3. Empty stream</a></li>
<li><a href="#sec-2-4-4">2.4.4. Mature streams (StreamNode)</a></li>
<li><a href="#sec-2-4-5">2.4.5. Immature streams (IFn)</a></li>
<li><a href="#sec-2-4-6">2.4.6. Differences from Clojure's Seq</a></li>
</ul>
</li>
<li><a href="#sec-2-5">2.5. Goals</a>
<ul>
<li><a href="#sec-2-5-1">2.5.1. States</a></li>
<li><a href="#sec-2-5-2">2.5.2. Goal functions</a></li>
<li><a href="#sec-2-5-3">2.5.3. Basic goal constructors</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. Sugar</a>
<ul>
<li><a href="#sec-3-1">3.1. Auxilliary macros</a></li>
<li><a href="#sec-3-2">3.2. Reificiation</a></li>
<li><a href="#sec-3-3">3.3. Programmer interface</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Sequences</a>
<ul>
<li><a href="#sec-4-1">4.1. Extending the core</a></li>
<li><a href="#sec-4-2">4.2. Sequence relations</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Back matter</a>
<ul>
<li><a href="#sec-5-1">5.1. Bibliography</a></li>
<li><a href="#sec-5-2">5.2. Differences from microKanren</a></li>
<li><a href="#sec-5-3">5.3. Differences from core.logic</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a literate implementation of miniKanren, a logic programming
system.  It's meant to be an introduction to the inner workings of
miniKanren and and of core.logic.
</p>

<p>
For maximum enjoyment, the reader should be familiar with Clojure, and
in particular with protocols. In lieu of that, basic understanding of
lisp syntax and a read through something like
<a href="http://clojure-doc.org/articles/language/polymorphism.html">http://clojure-doc.org/articles/language/polymorphism.html</a> should be
sufficient.
</p>

<p>
This code was derived substantially from microKanren; for more
information, see the bibliography at the end.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Relational core</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Logic Variables</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The purpose of a logic program is to takes an expression with some
unknowns in it and try to find values for those unknowns. Here's an
example logic program in English with an unknown <i>x</i>:
</p>

<blockquote>
<p>
Either x is the beginning of the list ["banana", "orange", "apple"],
or x is the number 1.
</p>
</blockquote>

<p>
(The two values of <i>x</i> that make this expression succeed are <code>1</code> and <code>banana</code>)
</p>

<p>
These unknowns are called <i>logic variables</i>, or <i>lvars</i> for
short. Since we're going to write our logic programs in Clojure, we
need a way to represent them.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defrecord</span> <span style="color: #228b22;">LVar</span> [id])
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">lvar</span> [id] (<span style="color: #228b22;">LVar.</span> id))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">lvar?</span> [x] (instance? <span style="color: #228b22;">LVar</span> x))
</pre>
</div>

<p>
An lvar's <i>id</i> could be anything, but we use it like a serial
number. The first lvar gets created with id 0, the next with id 1, and
so on. There is some special syntax to help with that, which we'll see
below.
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Substitutions and Walking</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Once we have determined a value for an lvar, we put it into a
substitution map (<i>s-map</i> for short). This is a regular clojure
hash-map with an lvar as a key. For example,
</p>

<div class="org-src-container">

<pre class="src src-clojure">{ (lvar 0) <span style="color: #8b2252;">"banana"</span> }
</pre>
</div>

<p>
is a substitution map that makes the above example succeed (as long as
<i>x</i> is lvar 0).
</p>

<p>
There is one twist to the substitution map: lvars can be values, as
well.  (This is called a <i>triangular</i> substitution) Here is an example
whose solution is a triangular substitution:
</p>

<blockquote>
<p>
Either x is the beginning of the list [y, "orange", "apple"], or x
is the number 1.
</p>

<p>
y is the string "banana".
</p>
</blockquote>

<p>
One substitution map which will make this example succeed is
</p>
<div class="org-src-container">

<pre class="src src-clojure">{ (lvar 0) (lvar 1)
  (lvar 1) <span style="color: #8b2252;">"banana"</span> }
</pre>
</div>

<p>
We define two operations on the substitution map. The first is for
adding add new entries.
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">add-substitution</span> [s-map lvar value]
  (<span style="color: #a020f0;">when</span> s-map
    (assoc s-map lvar value)))
</pre>
</div>

<p>
If you try to add something to a <code>nil</code> substitution map, we just
return <code>nil</code>. The <code>nil</code> substitution map is output when there are no
substitutions that can make an expression succeed. We'll see where
this is important when we start to build up substitution maps.
</p>

<p>
The other operation on a substitution map is to look things up. It's just
a hash-map, so why don't we just use the <code>get</code> function for this? Two reasons:
</p>

<ul class="org-ul">
<li>If there is an lvar on the right-hand side, we need to look up that
value, following them until we get to a non-lvar.
</li>

<li>The <code>walk</code> function really means "give me the value of object,
given this substitution map". So if you walk with a value that's
not an lvar, it should just give you that value back.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-clojure">(extend-protocol <span style="color: #228b22;">IWalk</span>
  <span style="color: #228b22;">LVar</span>
  (walk [u s-map] (<span style="color: #a020f0;">if-let</span> [val (get s-map u)]
                    (<span style="color: #a020f0;">recur</span> val s-map)
                    u))
  <span style="color: #228b22;">Object</span>
  (walk [u s-map] u)

  <span style="color: #008b8b;">nil</span>
  (walk [u s-map] <span style="color: #008b8b;">nil</span>))
</pre>
</div>

<p>
Here are some example <code>walk</code> invocations:
</p>
<div class="org-src-container">

<pre class="src src-clojure">&gt; (<span style="color: #a020f0;">def</span> <span style="color: #a0522d;">s-map</span> { (lvar 0) (lvar 1)
               (lvar 1) <span style="color: #8b2252;">"banana"</span> })

&gt; (walk (lvar 0) s-map)
<span style="color: #8b2252;">"banana"</span>

&gt; (walk (lvar 1) s-map)
<span style="color: #8b2252;">"banana"</span>

&gt; (walk <span style="color: #8b2252;">"mango"</span> s-map)
<span style="color: #8b2252;">"mango"</span>
</pre>
</div>


<p>
You might notice that it is easy to construct a substitution map with
a loop in it: <code>(walk a {a b, b a})</code> will not terminate. Most implementations
would handle that with a check in <code>add-substitution</code>, but we omit it here
for simplicity. (it's typically called <code>occurs-check</code>)
</p>
</div>
</div>
