literate.org
** Unification
~unify~ is the way we build up substitution maps. Given two values /u/
and /v/, and an existing substitution map /s-map/, ~unify~ produces a
new substitution map with mappings that will make u and v equal.

This is a rather subtle; let's walk through some examples.

- First, if either /u/ or /v/ is an lvar, the unifying them with a
  value just like assigning a value.

  #+begin_src clojure
    > (unify (lvar 0) "banana" {})
    {(lvar 0) "banana"}

    > (unify "banana" (lvar 0) {})
    {(lvar 0) "banana"}
  #+end_src

- But what if the lvar already has a value? Then there are two
  possibilities. Either the two values agree:
  #+begin_src clojure
    > (unify (lvar 0) "banana"
             {(lvar 0) "banana"})
    {(lvar 0) "banana"}
  #+end_src

  Or they do not, leading to a contradiction:
  #+begin_src clojure
    > (unify (lvar 0) "banana"
             {(lvar 0) "mango"})
    nil
  #+end_src

- When there's something un-related in the substitution map,
  we'll just add to it:
  #+begin_src clojure
    > (unify (lvar 0) "banana"
             {(lvar 9) "squirrels"})
    {(lvar 0) "banana"
     (lvar 9) "squirrels"}
  #+end_src

That's it for the basic cases. They seem pretty trivial, but our unifier has
one more nice feature: extensibility. By extending the IUnifyTerms protocol,
you can add unification behavior for other data structures as well. We do
this for sequences later on. But until then, here's a preview:

#+begin_src clojure
  > (unify [(lvar 0) 2 3] ["banana" 2 3] {})
  {(lvar 0) "banana"}
#+end_src

Here's the implementation of ~unify~:
#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (defn unify [u v s-map]
    (let [u (walk u s-map),    v (walk v s-map)
          u-is-lvar (lvar? u), v-is-lvar (lvar? v)]
      (cond
        ;; TODO is this case right???
        ;; Unifying two lvars adds no information to the substitution map
        (and u-is-lvar v-is-lvar (= u v)) s-map

        ;; Unifying an lvar with some other value creates a new entry in
        ;; the substitution map
        u-is-lvar (add-substitution s-map u v)
        v-is-lvar (add-substitution s-map v u)

        ;; two non-lvar values unify if they're equal
        (= u v) s-map

        ;; Unifying two non-lvars is delegated to the polymorphic
        ;; unify-terms function, from IUnifyTerms.
        :default (unify-terms u v s-map))))
#+end_src

Here are the basic IUnifyTerms definitions for Object and nil.  If we
get dispatched to either of these definitions, we know that neither u
or v is an lvar, that they aren't equal, and we aren't doing some kind
of structural comparison defined elsewhere. They must not unify.

#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
(extend-protocol IUnifyTerms
  Object (unify-terms [u v s-map] nil)
  nil    (unify-terms [u v s-map] nil))
#+end_src

** Lazy Streams
As we've alluded to above, when you run a logic program you can get more than
one result. MiniKanren's approach to this is really unique, and is one
of the most interesting parts of the program.

First, let's make a case for why we need a lazy stream
mechanism. Consider the program:
#+begin_quote
  Define Natural(x) to be true when either:
    - x is the number 0
    - x is greater than 0, and Natural(x - 1) is true
#+end_quote

Clearly there are an infinite number of substitution maps that make
this program succeed - ~{(lvar 0) 0}~, ~{(lvar 0) 1}~, ~{(lvar 0) 2}~,
and so on.

*** The definition of a logic program
1. In miniKanren, /the output of a logic program is a set of
   substitutions/ that make that program succeed.

2. A logic program is built by combining smaller logic programs using
   the conjunction (and) and disjunction (or) operators.

But we just saw that some logic programs may have an infinitely large
set of solutions. Clearly, we'll need to impose some order oin
them. And if you're combining two programs, each with infinite output,
there must be some way of going back and forth between the output of
each. This is the motivation for lazy streams.

*** Definition of a lazy stream
There are three kinds of lazy streams:
- Empty
- Mature (head realized)
- Immature (head unrealized)

A mature stream is one in which the first element of the stream has a
definite value that has already been computed. An immature stream, on
the other hand, does not yet have a computed head. Instead if has a
function which it can used to compute a mature (or empty) stream when
you need it.

You can manipulate a stream with these functions:
- Merge two of them together with ~merge-streams~
- Map a function over it with ~mapcat-stream~, as long as that
  function itself produces streams.
- Realize its head with ~realize-stream-head~. This will transition it
  to either immature or empty, performing any necessary work along the
  way.

*** Empty stream
#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (def empty-stream
    (reify IStream
      (merge-streams [stream-1 stream-2] stream-2)
      (mapcat-stream [stream g] stream)
      (realize-stream-head [stream] stream)
      (stream-to-seq [stream] '())))
#+end_src

