literate.html

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Unification</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<code>unify</code> is the way we build up substitution maps. Given two values <i>u</i>
and <i>v</i>, and an existing substitution map <i>s-map</i>, <code>unify</code> produces a
new substitution map with mappings that will make u and v equal.
</p>

<p>
This is a rather subtle; let's walk through some examples.
</p>

<ul class="org-ul">
<li>First, if either <i>u</i> or <i>v</i> is an lvar, the unifying them with a
value just like assigning a value.

<div class="org-src-container">

<pre class="src src-clojure">&gt; (unify (lvar 0) <span style="color: #8b2252;">"banana"</span> {})
{(lvar 0) <span style="color: #8b2252;">"banana"</span>}

&gt; (unify <span style="color: #8b2252;">"banana"</span> (lvar 0) {})
{(lvar 0) <span style="color: #8b2252;">"banana"</span>}
</pre>
</div>
</li>

<li>But what if the lvar already has a value? Then there are two
possibilities. Either the two values agree:
<div class="org-src-container">

<pre class="src src-clojure">&gt; (unify (lvar 0) <span style="color: #8b2252;">"banana"</span>
         {(lvar 0) <span style="color: #8b2252;">"banana"</span>})
{(lvar 0) <span style="color: #8b2252;">"banana"</span>}
</pre>
</div>

<p>
Or they do not, leading to a contradiction:
</p>
<div class="org-src-container">

<pre class="src src-clojure">&gt; (unify (lvar 0) <span style="color: #8b2252;">"banana"</span>
         {(lvar 0) <span style="color: #8b2252;">"mango"</span>})
<span style="color: #008b8b;">nil</span>
</pre>
</div>
</li>

<li>When there's something un-related in the substitution map,
we'll just add to it:
<div class="org-src-container">

<pre class="src src-clojure">&gt; (unify (lvar 0) <span style="color: #8b2252;">"banana"</span>
         {(lvar 9) <span style="color: #8b2252;">"squirrels"</span>})
{(lvar 0) <span style="color: #8b2252;">"banana"</span>
 (lvar 9) <span style="color: #8b2252;">"squirrels"</span>}
</pre>
</div>
</li>
</ul>

<p>
That's it for the basic cases. They seem pretty trivial, but our unifier has
one more nice feature: extensibility. By extending the IUnifyTerms protocol,
you can add unification behavior for other data structures as well. We do
this for sequences later on. But until then, here's a preview:
</p>

<div class="org-src-container">

<pre class="src src-clojure">&gt; (unify [(lvar 0) 2 3] [<span style="color: #8b2252;">"banana"</span> 2 3] {})
{(lvar 0) <span style="color: #8b2252;">"banana"</span>}
</pre>
</div>

<p>
Here's the implementation of <code>unify</code>:
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">unify</span> [u v s-map]
  (<span style="color: #a020f0;">let</span> [u (walk u s-map),    v (walk v s-map)
        u-is-lvar (lvar? u), v-is-lvar (lvar? v)]
    (<span style="color: #a020f0;">cond</span>
      <span style="color: #b22222;">;; </span><span style="color: #b22222;">TODO is this case right???</span>
      <span style="color: #b22222;">;; </span><span style="color: #b22222;">Unifying two lvars adds no information to the substitution map</span>
      (<span style="color: #a020f0;">and</span> u-is-lvar v-is-lvar (= u v)) s-map

      <span style="color: #b22222;">;; </span><span style="color: #b22222;">Unifying an lvar with some other value creates a new entry in</span>
      <span style="color: #b22222;">;; </span><span style="color: #b22222;">the substitution map</span>
      u-is-lvar (add-substitution s-map u v)
      v-is-lvar (add-substitution s-map v u)

      <span style="color: #b22222;">;; </span><span style="color: #b22222;">two non-lvar values unify if they're equal</span>
      (= u v) s-map

      <span style="color: #b22222;">;; </span><span style="color: #b22222;">Unifying two non-lvars is delegated to the polymorphic</span>
      <span style="color: #b22222;">;; </span><span style="color: #b22222;">unify-terms function, from IUnifyTerms.</span>
      <span style="color: #008b8b;">:default</span> (unify-terms u v s-map))))
</pre>
</div>

<p>
Here are the basic IUnifyTerms definitions for Object and nil.  If we
get dispatched to either of these definitions, we know that neither u
or v is an lvar, that they aren't equal, and we aren't doing some kind
of structural comparison defined elsewhere. They must not unify.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(extend-protocol <span style="color: #228b22;">IUnifyTerms</span>
  <span style="color: #228b22;">Object</span> (unify-terms [u v s-map] <span style="color: #008b8b;">nil</span>)
  <span style="color: #008b8b;">nil</span>    (unify-terms [u v s-map] <span style="color: #008b8b;">nil</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Lazy Streams</h3>
<div class="outline-text-3" id="text-2-4">
<p>
As we've alluded to above, when you run a logic program you can get more than
one result. MiniKanren's approach to this is really unique, and is one
of the most interesting parts of the program.
</p>

<p>
First, let's make a case for why we need a lazy stream
mechanism. Consider the program:
</p>
<blockquote>
<p>
Define Natural(x) to be true when either:
</p>
<ul class="org-ul">
<li>x is the number 0
</li>
<li>x is greater than 0, and Natural(x - 1) is true
</li>
</ul>
</blockquote>

<p>
Clearly there are an infinite number of substitution maps that make
this program succeed - <code>{(lvar 0) 0}</code>, <code>{(lvar 0) 1}</code>, <code>{(lvar 0) 2}</code>,
and so on.
</p>
</div>

<div id="outline-container-sec-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> The definition of a logic program</h4>
<div class="outline-text-4" id="text-2-4-1">
<ol class="org-ol">
<li>In miniKanren, <i>the output of a logic program is a set of
substitutions</i> that make that program succeed.
</li>

<li>A logic program is built by combining smaller logic programs using
the conjunction (and) and disjunction (or) operators.
</li>
</ol>

<p>
But we just saw that some logic programs may have an infinitely large
set of solutions. Clearly, we'll need to impose some order oin
them. And if you're combining two programs, each with infinite output,
there must be some way of going back and forth between the output of
each. This is the motivation for lazy streams.
</p>
</div>
</div>

<div id="outline-container-sec-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="section-number-4">2.4.2</span> Definition of a lazy stream</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
There are three kinds of lazy streams:
</p>
<ul class="org-ul">
<li>Empty
</li>
<li>Mature (head realized)
</li>
<li>Immature (head unrealized)
</li>
</ul>

<p>
A mature stream is one in which the first element of the stream has a
definite value that has already been computed. An immature stream, on
the other hand, does not yet have a computed head. Instead if has a
function which it can used to compute a mature (or empty) stream when
you need it.
</p>

<p>
You can manipulate a stream with these functions:
</p>
<ul class="org-ul">
<li>Merge two of them together with <code>merge-streams</code>
</li>
<li>Map a function over it with <code>mapcat-stream</code>, as long as that
function itself produces streams.
</li>
<li>Realize its head with <code>realize-stream-head</code>. This will transition it
to either immature or empty, performing any necessary work along the
way.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-4-3" class="outline-4">
<h4 id="sec-2-4-3"><span class="section-number-4">2.4.3</span> Empty stream</h4>
<div class="outline-text-4" id="text-2-4-3">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">def</span> <span style="color: #a0522d;">empty-stream</span>
  (reify <span style="color: #228b22;">IStream</span>
    (merge-streams [stream-1 stream-2] stream-2)
    (mapcat-stream [stream g] stream)
    (realize-stream-head [stream] stream)
    (stream-to-seq [stream] '())))
</pre>
</div>
</div>
</div>
