literate.org
*** Mature streams (StreamNode)
A mature streams is represented by an instance of StreamNode.  This is
kind of like a linked list: /head/ is the realized value that can be
taken from the stream, and /next/ is the stream which follows.  But
these streams are polymorphic; /next/ isn't necessarily a StreamNode,
just some other thing which extends the IStream protocol.

Note that, if we have only StreamNodes (i.e. fully realized streams),
~merge-streams~ is equivalent to ~concat~ and ~mapcat-stream~ to
~mapcat~.

#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
    (deftype StreamNode [head next]
      IStream
      (merge-streams [stream-1 stream-2] (StreamNode. head
                                                      (merge-streams next stream-2)))
      (mapcat-stream [stream g] (merge-streams (g head)
                                               (mapcat-stream next g)))
      (realize-stream-head [stream] stream)

      (stream-to-seq [stream] (lazy-seq (cons head (stream-to-seq next)))))

  (defn make-stream [s] (StreamNode. s empty-stream))
#+end_src

*** Immature streams (IFn)
An immature stream is represented by a thunk (a function of no
arguments).

Executing the thunk does one unit of work and returns a new
stream. This may in turn be a function, so you might have to keep
calling the returned function many times until you get down to a
realized value. This is exactly what ~realize-stream-head~ does here,
by way of ~trampoline~.

**** Merging
Merging is tricky - this is what makes the search interleaving. Let's
examine the definition:
#+begin_src clojure
   clojure.lang.IFn
   (merge-streams [stream-1 stream-2]
     #(merge-streams stream-2 (stream-1)))
#+end_src


Working from the inside out: we know that stream-1 is a function because
we're extending IStream onto IFn; calling it will perform one 'step
of computation', whatever that might be. It returns a stream.
Then we merge that stream with stream-2, the second parameter of this merge operation,
/but the order is reversed/.

Finally, the above operation is all wrapped in a thunk. So we end up with a
function that:

- performs the work for the first thing you constructed it with
- returns a new stream, putting the second thing you constructed it
  with at the head.

An imaginary repl session may make this clearer:
#+begin_src clojure
    > (def a #(make-stream (+ 1 1)))
    > (def b #(stream (+ 10 20))
    > (def s (merge-streams a b))
    #(merge-streams #(make-stream (+ 10 20) (#(make-stream (+ 1 1))))

    > (def s' (s))
    #(merge-streams (StreamNode. 2 nil) (#(make-stream (+ 10 20))))

    > (def s'' (s'))
    (StreamNode. 2 (StreamNode. 30))
#+end_src

**** Mapping
~mapcat-stream~ is somewhat simpler.

#+begin_src clojure
  clojure.lang.IFn
  (mapcat-stream [stream g]
    #(mapcat-stream (stream) g))
#+end_src

The basic concept here is pretty straightforward: make a new thunk which,
when executed later, will do some work and then mapcat ~g~ over the result.

*TODO*: explain why this needs to be wrapped in a thunk

**** Definition
Here is the whole definition of IStream for functions:

#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (extend-protocol IStream
    clojure.lang.IFn
    (merge-streams [stream-1 stream-2]
      #(merge-streams stream-2 (stream-1)))

    (mapcat-stream [stream g]
      #(mapcat-stream (stream) g))

    (realize-stream-head [stream]
      (trampoline stream))

    (stream-to-seq [stream]
      (stream-to-seq (realize-stream-head stream))))
#+end_src

*** Differences from Clojure's Seq
This is very similar to Clojure's Seq abstraction; why not just use
that? Well, there are cases where you are combining the results of two
logic programs (with merge-streams), but one of them might
diverge. This is actually fairly easy to cause in miniKanren, if
you're not careful about the way you do recursive calls. The lazy
stream system shown here handles that case by giving each stream equal
processing time, evaluating its thunks as they come. In this sense,
lazy streams are a scheduling system for processes which may return
multiple outputs.

** Goals
Until now, we have talked about a logic program returning a set of
substitutions. This was a small lie, which we now refine into the
actual implementation.

*** States
A /state/ is a record containing a substitution map *s-map* and the id
of the next unused logic variable, /next-id/.
#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (defrecord State [s-map next-id])

  (defn make-state [s-map next-id] (State. s-map next-id))
  (def empty-state (make-state {} 0))
  (defn with-s-map [state s-map] (assoc state :s-map s-map))
  (defn with-next-id [state next-id] (assoc state :next-id next-id))
#+end_src

*** Goal functions
A goal is a function which, given a state, returns a stream of
states. It encapsulates a logic program. Give it an input state, and
it will give you one output state for each way it can make that
program succeed, given the information in the input state.

