literate.html

<div id="outline-container-sec-2-4-4" class="outline-4">
<h4 id="sec-2-4-4"><span class="section-number-4">2.4.4</span> Mature streams (StreamNode)</h4>
<div class="outline-text-4" id="text-2-4-4">
<p>
A mature streams is represented by an instance of StreamNode.  This is
kind of like a linked list: <i>head</i> is the realized value that can be
taken from the stream, and <i>next</i> is the stream which follows.  But
these streams are polymorphic; <i>next</i> isn't necessarily a StreamNode,
just some other thing which extends the IStream protocol.
</p>

<p>
Note that, if we have only StreamNodes (i.e. fully realized streams),
<code>merge-streams</code> is equivalent to <code>concat</code> and <code>mapcat-stream</code> to
<code>mapcat</code>.
</p>

<div class="org-src-container">

<pre class="src src-clojure">  (<span style="color: #a020f0;">deftype</span> <span style="color: #228b22;">StreamNode</span> [head next]
    <span style="color: #228b22;">IStream</span>
    (merge-streams [stream-1 stream-2] (<span style="color: #228b22;">StreamNode.</span> head
                                                    (merge-streams next stream-2)))
    (mapcat-stream [stream g] (merge-streams (g head)
                                             (mapcat-stream next g)))
    (realize-stream-head [stream] stream)

    (stream-to-seq [stream] (lazy-seq (cons head (stream-to-seq next)))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">make-stream</span> [s] (<span style="color: #228b22;">StreamNode.</span> s empty-stream))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4-5" class="outline-4">
<h4 id="sec-2-4-5"><span class="section-number-4">2.4.5</span> Immature streams (IFn)</h4>
<div class="outline-text-4" id="text-2-4-5">
<p>
An immature stream is represented by a thunk (a function of no
arguments).
</p>

<p>
Executing the thunk does one unit of work and returns a new
stream. This may in turn be a function, so you might have to keep
calling the returned function many times until you get down to a
realized value. This is exactly what <code>realize-stream-head</code> does here,
by way of <code>trampoline</code>.
</p>
</div>

<ol class="org-ol"><li><a id="sec-2-4-5-1" name="sec-2-4-5-1"></a>Merging<br  /><div class="outline-text-5" id="text-2-4-5-1">
<p>
Merging is tricky - this is what makes the search interleaving. Let's
examine the definition:
</p>
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #228b22;">clojure.lang.IFn</span>
(merge-streams [stream-1 stream-2]
  #(merge-streams stream-2 (stream-1)))
</pre>
</div>


<p>
Working from the inside out: we know that stream-1 is a function because
we're extending IStream onto IFn; calling it will perform one 'step
of computation', whatever that might be. It returns a stream.
Then we merge that stream with stream-2, the second parameter of this merge operation,
<i>but the order is reversed</i>.
</p>

<p>
Finally, the above operation is all wrapped in a thunk. So we end up with a
function that:
</p>

<ul class="org-ul">
<li>performs the work for the first thing you constructed it with
</li>
<li>returns a new stream, putting the second thing you constructed it
with at the head.
</li>
</ul>

<p>
An imaginary repl session may make this clearer:
</p>
<div class="org-src-container">

<pre class="src src-clojure">&gt; (<span style="color: #a020f0;">def</span> <span style="color: #a0522d;">a</span> #(make-stream (+ 1 1)))
&gt; (<span style="color: #a020f0;">def</span> <span style="color: #a0522d;">b</span> #(stream (+ 10 20))
&gt; (<span style="color: #a020f0;">def</span> <span style="color: #a0522d;">s</span> (merge-streams a b))
#(merge-streams #(make-stream (+ 10 20) (#(make-stream (+ 1 1))))

&gt; (<span style="color: #a020f0;">def</span> <span style="color: #a0522d;">s</span>' (s))
#(merge-streams (<span style="color: #228b22;">StreamNode.</span> 2 <span style="color: #008b8b;">nil</span>) (#(make-stream (+ 10 20))))

&gt; (<span style="color: #a020f0;">def</span> <span style="color: #a0522d;">s</span>'' (s'))
(<span style="color: #228b22;">StreamNode.</span> 2 (<span style="color: #228b22;">StreamNode.</span> 30))
</pre>
</div>
</div>
</li>

<li><a id="sec-2-4-5-2" name="sec-2-4-5-2"></a>Mapping<br  /><div class="outline-text-5" id="text-2-4-5-2">
<p>
<code>mapcat-stream</code> is somewhat simpler.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #228b22;">clojure.lang.IFn</span>
(mapcat-stream [stream g]
  #(mapcat-stream (stream) g))
</pre>
</div>

<p>
The basic concept here is pretty straightforward: make a new thunk which,
when executed later, will do some work and then mapcat <code>g</code> over the result.
</p>

<p>
<b>TODO</b>: explain why this needs to be wrapped in a thunk
</p>
</div>
</li>

<li><a id="sec-2-4-5-3" name="sec-2-4-5-3"></a>Definition<br  /><div class="outline-text-5" id="text-2-4-5-3">
<p>
Here is the whole definition of IStream for functions:
</p>

<div class="org-src-container">

<pre class="src src-clojure">(extend-protocol <span style="color: #228b22;">IStream</span>
  <span style="color: #228b22;">clojure.lang.IFn</span>
  (merge-streams [stream-1 stream-2]
    #(merge-streams stream-2 (stream-1)))

  (mapcat-stream [stream g]
    #(mapcat-stream (stream) g))

  (realize-stream-head [stream]
    (trampoline stream))

  (stream-to-seq [stream]
    (stream-to-seq (realize-stream-head stream))))
</pre>
</div>
</div>
</li></ol>
</div>

<div id="outline-container-sec-2-4-6" class="outline-4">
<h4 id="sec-2-4-6"><span class="section-number-4">2.4.6</span> Differences from Clojure's Seq</h4>
<div class="outline-text-4" id="text-2-4-6">
<p>
This is very similar to Clojure's Seq abstraction; why not just use
that? Well, there are cases where you are combining the results of two
logic programs (with merge-streams), but one of them might
diverge. This is actually fairly easy to cause in miniKanren, if
you're not careful about the way you do recursive calls. The lazy
stream system shown here handles that case by giving each stream equal
processing time, evaluating its thunks as they come. In this sense,
lazy streams are a scheduling system for processes which may return
multiple outputs.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Goals</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Until now, we have talked about a logic program returning a set of
substitutions. This was a small lie, which we now refine into the
actual implementation.
</p>
</div>

<div id="outline-container-sec-2-5-1" class="outline-4">
<h4 id="sec-2-5-1"><span class="section-number-4">2.5.1</span> States</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
A <i>state</i> is a record containing a substitution map <b>s-map</b> and the id
of the next unused logic variable, <i>next-id</i>.
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defrecord</span> <span style="color: #228b22;">State</span> [s-map next-id])

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">make-state</span> [s-map next-id] (<span style="color: #228b22;">State.</span> s-map next-id))
(<span style="color: #a020f0;">def</span> <span style="color: #a0522d;">empty-state</span> (make-state {} 0))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">with-s-map</span> [state s-map] (assoc state <span style="color: #008b8b;">:s-map</span> s-map))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">with-next-id</span> [state next-id] (assoc state <span style="color: #008b8b;">:next-id</span> next-id))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-5-2" class="outline-4">
<h4 id="sec-2-5-2"><span class="section-number-4">2.5.2</span> Goal functions</h4>
<div class="outline-text-4" id="text-2-5-2">
<p>
A goal is a function which, given a state, returns a stream of
states. It encapsulates a logic program. Give it an input state, and
it will give you one output state for each way it can make that
program succeed, given the information in the input state.
</p>
</div>
</div>
