literate.org
*** Basic goal constructors
Rather than dealing with goals directly, we usually use
/goal constructors/; given some parameter (usually a unification term or
another goal), they will return a goal function which closes over
it.

The most fundamental goal constructor is for unification.  Given two
terms u and v, this creates a goal that will unify them. The goal
takes an existing state and returns either a state with bindings for
the lvars in u and v (using ~unify~), or returns the empty stream if
no such state exists.

#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (defn === [u v]
    (fn unify-goal [{:keys [s-map] :as state}]
      (if-let [s-map' (unify u v s-map)]
        (make-stream (with-s-map state s-map'))
        empty-stream)))
#+end_src

/call-fresh/ will wrap /goal-constructor/, a function of a single
lvar, in a goal that allocates a new lvar from its state parameter and
passes it to /goal-constructor/. For a more practical way of using
this, see the /fresh/ macro below.

#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (defn call-fresh [goal-constructor]
    (fn fresh-goal [{:keys [s-map next-id] :as state}]
      (let [goal (goal-constructor (lvar next-id))]
       (goal (with-next-id state (inc next-id))))))
#+end_src

Logical disjuction ('or') is done with ldisj, which constructs a new
goal that succeeds whenever /goal-1/ or /goal-2/ succeeds.
~merge-streams~ is used on each goal's output to ensure fair
scheduling between the two.

#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (defn ldisj [goal-1 goal-2]
    (fn disj-goal [state]
      (merge-streams (goal-1 state) (goal-2 state))))
#+end_src

Logical conjunction ('and') is done with lconj. It constructs a new
goal that succeeds when both /goal-1/ and /goal-2/ succeed.

#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
(defn lconj [goal-1 goal-2]
  (fn conj-goal [state]
    (mapcat-stream (goal-1 state) goal-2)))
#+end_src

* Sugar
** Auxilliary macros
At this point, we have defined everything we need to do logic
programming.  But it's very inconvenient; some utility macros make the
task more bearable.

/delay-goal/ will wrap the given goal in a new one which, when
executed, simply returns a thunk. Recall that goal functions return
streams, and that a function is a valid kind of stream (an immature
stream). The goal will finally be executed when the thunk is evaluated
by realize-stream-head.

This is especially useful when defining recursive goals.

#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (defmacro delay-goal [goal]
    `(fn delayed-goal-outer [state#]
       (fn delayed-goal-inner [] (~goal state#))))
#+end_src

We also define extended versions of the ~ldisj~ and ~lconj~
functions. These handle multiple arguments, instead of just two. They
also automatically wraps each goal with ~delay-goal~, so you don't
need to worry about adding delays yourself.

(This does have a performance cost, but speed is not the point of this
implementation)

#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (defmacro ldisj+
    ([goal] `(delay-goal ~goal))
    ([goal & goals] `(ldisj (delay-goal ~goal) (ldisj+ ~@goals))))
#+end_src

#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (defmacro lconj+
    ([goal] `(delay-goal ~goal))
    ([goal & goals] `(lconj (delay-goal ~goal) (lconj+ ~@goals))))
#+end_src

** Reificiation
In miniKanren, reification refers to extracting the desired values
from the stream of states you get as a result of executing a goal.

When there are logic variables in the output which were not assigned
a value, they are named "_.0", "_.1", and so on.
#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (defn reify-name [n]
    (symbol (str "_." n)))
#+end_src

/reify-s-map/ creates a substitution map with reified values in it. It bases
This on the supplied /s-map/ parameter, but adds entries for each unknown
that appears in the /v/ parameter, using values from /reify-name/.
#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (defn reify-s [v s-map]
    (reify-s* (walk v s-map) s-map))

  (extend-protocol IReifySubstitution
    LVar
    (reify-s* [v s-map] (let [n (reify-name (count s-map))]
                          (add-substitution s-map v n)))

    Object
    (reify-s* [v s-map] s-map)

    nil
    (reify-s* [v s-map] s-map))
#+end_src

/deep-walk/ is like walk, but instead of simply returning any
non-lvar value, it will attempt to assign values to any lvars
embedded in it.  For example, ~(deep-walk a {a (1 2 c), c 3)}~ will
give ~(1 2 3)~.  (once we have the sequence extensions, which are
defined below)
#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (defn deep-walk [v s-map]
    (deep-walk* (walk v s-map) s-map))

  (extend-protocol IDeepWalk
    LVar   (deep-walk* [v s-map] v)
    Object (deep-walk* [v s-map] v)
    nil    (deep-walk* [v s-map] v))
#+end_src

Finally, we can define the actual reifier. Given a state, this will
give you the reified value of the first lvar that was defined. If
you're using the /run/ macro defined below, this will be your query
variable.
#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (defn reify-state-first-var [{:keys [s-map]}]
    (let [v (deep-walk (lvar 0) s-map)]
      (deep-walk v (reify-s v {}))))
#+end_src

