literate.html

<div id="outline-container-sec-2-5-3" class="outline-4">
<h4 id="sec-2-5-3"><span class="section-number-4">2.5.3</span> Basic goal constructors</h4>
<div class="outline-text-4" id="text-2-5-3">
<p>
Rather than dealing with goals directly, we usually use
<i>goal constructors</i>; given some parameter (usually a unification term or
another goal), they will return a goal function which closes over
it.
</p>

<p>
The most fundamental goal constructor is for unification.  Given two
terms u and v, this creates a goal that will unify them. The goal
takes an existing state and returns either a state with bindings for
the lvars in u and v (using <code>unify</code>), or returns the empty stream if
no such state exists.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">===</span> [u v]
  (<span style="color: #a020f0;">fn</span> unify-goal [{<span style="color: #008b8b;">:keys</span> [s-map] <span style="color: #008b8b;">:as</span> state}]
    (<span style="color: #a020f0;">if-let</span> [s-map' (unify u v s-map)]
      (make-stream (with-s-map state s-map'))
      empty-stream)))
</pre>
</div>

<p>
<i>call-fresh</i> will wrap <i>goal-constructor</i>, a function of a single
lvar, in a goal that allocates a new lvar from its state parameter and
passes it to <i>goal-constructor</i>. For a more practical way of using
this, see the <i>fresh</i> macro below.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">call-fresh</span> [goal-constructor]
  (<span style="color: #a020f0;">fn</span> fresh-goal [{<span style="color: #008b8b;">:keys</span> [s-map next-id] <span style="color: #008b8b;">:as</span> state}]
    (<span style="color: #a020f0;">let</span> [goal (goal-constructor (lvar next-id))]
     (goal (with-next-id state (inc next-id))))))
</pre>
</div>

<p>
Logical disjuction ('or') is done with ldisj, which constructs a new
goal that succeeds whenever <i>goal-1</i> or <i>goal-2</i> succeeds.
<code>merge-streams</code> is used on each goal's output to ensure fair
scheduling between the two.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">ldisj</span> [goal-1 goal-2]
  (<span style="color: #a020f0;">fn</span> disj-goal [state]
    (merge-streams (goal-1 state) (goal-2 state))))
</pre>
</div>

<p>
Logical conjunction ('and') is done with lconj. It constructs a new
goal that succeeds when both <i>goal-1</i> and <i>goal-2</i> succeed.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">lconj</span> [goal-1 goal-2]
  (<span style="color: #a020f0;">fn</span> conj-goal [state]
    (mapcat-stream (goal-1 state) goal-2)))
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Sugar</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Auxilliary macros</h3>
<div class="outline-text-3" id="text-3-1">
<p>
At this point, we have defined everything we need to do logic
programming.  But it's very inconvenient; some utility macros make the
task more bearable.
</p>

<p>
<i>delay-goal</i> will wrap the given goal in a new one which, when
executed, simply returns a thunk. Recall that goal functions return
streams, and that a function is a valid kind of stream (an immature
stream). The goal will finally be executed when the thunk is evaluated
by realize-stream-head.
</p>

<p>
This is especially useful when defining recursive goals.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">delay-goal</span> [goal]
  `(<span style="color: #a020f0;">fn</span> delayed-goal-outer [state#]
     (<span style="color: #a020f0;">fn</span> delayed-goal-inner [] (~goal state#))))
</pre>
</div>

<p>
We also define extended versions of the <code>ldisj</code> and <code>lconj</code>
functions. These handle multiple arguments, instead of just two. They
also automatically wraps each goal with <code>delay-goal</code>, so you don't
need to worry about adding delays yourself.
</p>

<p>
(This does have a performance cost, but speed is not the point of this
implementation)
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">ldisj+</span>
  ([goal] `(delay-goal ~goal))
  ([goal &amp; goals] `(ldisj (delay-goal ~goal) (ldisj+ ~@goals))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">lconj+</span>
  ([goal] `(delay-goal ~goal))
  ([goal &amp; goals] `(lconj (delay-goal ~goal) (lconj+ ~@goals))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Reificiation</h3>
<div class="outline-text-3" id="text-3-2">
<p>
In miniKanren, reification refers to extracting the desired values
from the stream of states you get as a result of executing a goal.
</p>

<p>
When there are logic variables in the output which were not assigned
a value, they are named "_.0", "_.1", and so on.
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">reify-name</span> [n]
  (symbol (str <span style="color: #8b2252;">"_."</span> n)))
</pre>
</div>

<p>
<i>reify-s-map</i> creates a substitution map with reified values in it. It bases
This on the supplied <i>s-map</i> parameter, but adds entries for each unknown
that appears in the <i>v</i> parameter, using values from <i>reify-name</i>.
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">reify-s</span> [v s-map]
  (reify-s* (walk v s-map) s-map))

(extend-protocol <span style="color: #228b22;">IReifySubstitution</span>
  <span style="color: #228b22;">LVar</span>
  (reify-s* [v s-map] (<span style="color: #a020f0;">let</span> [n (reify-name (count s-map))]
                        (add-substitution s-map v n)))

  <span style="color: #228b22;">Object</span>
  (reify-s* [v s-map] s-map)

  <span style="color: #008b8b;">nil</span>
  (reify-s* [v s-map] s-map))
</pre>
</div>

<p>
<i>deep-walk</i> is like walk, but instead of simply returning any
non-lvar value, it will attempt to assign values to any lvars
embedded in it.  For example, <code>(deep-walk a {a (1 2 c), c 3)}</code> will
give <code>(1 2 3)</code>.  (once we have the sequence extensions, which are
defined below)
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">deep-walk</span> [v s-map]
  (deep-walk* (walk v s-map) s-map))

(extend-protocol <span style="color: #228b22;">IDeepWalk</span>
  <span style="color: #228b22;">LVar</span>   (deep-walk* [v s-map] v)
  <span style="color: #228b22;">Object</span> (deep-walk* [v s-map] v)
  <span style="color: #008b8b;">nil</span>    (deep-walk* [v s-map] v))
</pre>
</div>

<p>
Finally, we can define the actual reifier. Given a state, this will
give you the reified value of the first lvar that was defined. If
you're using the <i>run</i> macro defined below, this will be your query
variable.
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">reify-state-first-var</span> [{<span style="color: #008b8b;">:keys</span> [s-map]}]
  (<span style="color: #a020f0;">let</span> [v (deep-walk (lvar 0) s-map)]
    (deep-walk v (reify-s v {}))))
</pre>
</div>
</div>
</div>
