literate.org
** Programmer interface
Define the regular miniKanren ~conde~ form, a disjunction of
conjunctions (an 'or' of 'ands'). Supposing that /a/ and /b/ are
lvars,

#+begin_src clojure
  (conde
    [(=== a 1) (=== b 2)]
    [(=== a 7) (=== b 12)})
#+end_src

will produce two results: ~{a 1, b 2}~ and ~{a 7, b 12}~.

#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (defmacro conde
    [& clauses]
    `(ldisj+ ~@(map (fn [clause]
                      `(lconj+ ~@clause))
                    clauses)))
#+end_src

The ~fresh~ macro provides a more convenient syntax for
~call-fresh~. ~fresh~ lets you declare multiple logic variables at
once, and it takes care of the function declaration mechanics for you.

The body of fresh is passed to ~lconj+~, a logical 'and'.
#+begin_src clojure
  (fresh [x y
    (=== x 1)
    (=== y 2))
#+end_src

Will give one result, ~{x 1, y 2}~.
#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (defmacro fresh
    [var-vec & clauses]
    (if (empty? var-vec)
      `(lconj+ ~@clauses)
      `(call-fresh (fn [~(first var-vec)]
                     (fresh [~@(rest var-vec)]
                       ~@clauses)))))
#+end_src

A utility to invoke a goal with an empty state, as you might do
when running a logic program from scratch:
#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (defn call-empty-state [goal]
    (goal empty-state))
#+end_src

Finally, the run* macro gives us a lazy sequence of readable (reified) values.
#+begin_src clojure
  > (run* [q]
      (conde
        [(=== q 1)]
        [(=== q 7)]))
  (1 7)
#+end_src

#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (defmacro run* [fresh-var-vec & goals]
    `(->> (fresh [~@fresh-var-vec] ~@goals)
       call-empty-state
       stream-to-seq
       (map reify-state-first-var)))
#+end_src

If you only want a few values (for example, if you know there are an
infinite number of results), (run n [q] <<goals>>) can do that. It's
equivalent to running ~take~ on the output of run*.
#+begin_src clojure :tangle "src/micro_logic/core.clj" :comments org
  (defmacro run [n fresh-var-vec & goals]
    `(take ~n (run* ~fresh-var-vec ~@goals)))
#+end_src

* Sequences
The base logic programming system has unification and reification
support for only lvars and basic values. But it's done in an
extensible way. We'll now proceed to add sequence support to the base
language.

** COMMENT Header
#+begin_src clojure :tangle "src/micro_logic/sequence.clj" :comments org
  (ns micro-logic.sequence
    (:require [micro-logic.core :refer :all]
              [micro-logic.protocols :refer :all]))
#+end_src

** Extending the core
When we unify sequences, we'd like to be able to indicate that an lvar
should be associated with the tail of a sequence. In the scheme
implementation, this is easy: by placing an lvar in the tail position
of a linked list node (the cdr position of a cons node), the
unification happens naturally when walking down the list.

Since Clojure disallows putting non-list items in linked-list cells
(so-called 'improper lists'), we have to find another way to do
it. core.logic solves this problem by defining its own LCons data type
which does allow improper lists. We take a different approach here.

Whenver you want an improper list in the context of a logic program,
you can signify it with the 'dot' sigil. For example: ~[1 2 dot a]~.
This is meant to evoke the Scheme and Common LISP notation for
improper lists: ~(1 2 . 3)~. This will typically be transparent to the
user on the programming side, since such lists will be automatically
constructed by the 'conso' goal below.

#+begin_src clojure :tangle "src/micro_logic/sequence.clj" :comments org
  (deftype Dot [])
  (def dot (Dot.))
#+end_src

There are times when the user may see an improper list as the result
of a query. In this case, print the sigil as "."

#+begin_src clojure :tangle "src/micro_logic/sequence.clj" :comments org
  (defmethod print-method Dot [l ^java.io.Writer w]
    (.write w "."))
#+end_src

The first extension point is the unifier; we need to define what it means
to unify a sequence with something else.

The basic case is simple: if unifying a sequence with another sequence,
then we should unify each element together. Recursively, this means unifying
their first elements and then the rest of the sequence.

The unifier also needs to be aware of the dot-notation described
above. If either /u/ or /v/ is a sequence beginning with a dot, the
its second item must be an lvar which should be unified with the other
variable. For example, if we start with ~(=== [1 2 3] [1 . a])~, it
will recurse down to ~(=== [2 3] [. a])~. Detecting that, we can call
~(=== [2 3] a)~, which gives the desired result.

#+begin_src clojure :tangle "src/micro_logic/sequence.clj" :comments org
  (extend-protocol IUnifyTerms
    clojure.lang.Sequential
    (unify-terms [u v s]
      (cond
        (= dot (first u)) (unify (second u) v s)
        (= dot (first v)) (unify u (second v) s)
        (seq v) (->> s
                  (unify (first u) (first v))
                  (unify (rest u) (rest v))))))
#+end_src

Next, we need to extend the reifier. When calling reify-s, we need to
look for occurences of logic variables inside of given paramter. This
extends reify-s to make a recursive call on the first element of the
sequence, then on the remaining elements.

#+begin_src clojure :tangle "src/micro_logic/sequence.clj" :comments org
  (extend-protocol IReifySubstitution
    clojure.lang.Sequential
    (reify-s* [v s-map]
      (if (seq v)
        (reify-s (rest v) (reify-s (first v) s-map))
        s-map)))
#+end_src

Deep-walk needs to be extended as well. As above, we we handle
sequences beginning with 'dot' as a special case, go recursing back
with the second item of the sequence.  For any other sequences, we
effectively map the deep-walk function over the sequence.

#+begin_src clojure :tangle "src/micro_logic/sequence.clj" :comments org
  (extend-protocol IDeepWalk
    clojure.lang.Sequential
    (deep-walk* [v s-map]
      (cond
        (and (= dot (first v))
             (sequential? (second v)))
        (deep-walk (second v) s-map)

        (seq v)
        (cons (deep-walk (first v) s-map)
              (deep-walk (rest v)  s-map))

        :default v)))
#+end_src

