literate.html

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Programmer interface</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Define the regular miniKanren <code>conde</code> form, a disjunction of
conjunctions (an 'or' of 'ands'). Supposing that <i>a</i> and <i>b</i> are
lvars,
</p>

<div class="org-src-container">

<pre class="src src-clojure">(conde
  [(=== a 1) (=== b 2)]
  [(=== a 7) (=== b 12)})
</pre>
</div>

<p>
will produce two results: <code>{a 1, b 2}</code> and <code>{a 7, b 12}</code>.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">conde</span>
  [&amp; clauses]
  `(ldisj+ ~@(map (<span style="color: #a020f0;">fn</span> [clause]
                    `(lconj+ ~@clause))
                  clauses)))
</pre>
</div>

<p>
The <code>fresh</code> macro provides a more convenient syntax for
<code>call-fresh</code>. <code>fresh</code> lets you declare multiple logic variables at
once, and it takes care of the function declaration mechanics for you.
</p>

<p>
The body of fresh is passed to <code>lconj+</code>, a logical 'and'.
</p>
<div class="org-src-container">

<pre class="src src-clojure">(fresh [x y
  (=== x 1)
  (=== y 2))
</pre>
</div>

<p>
Will give one result, <code>{x 1, y 2}</code>.
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">fresh</span>
  [var-vec &amp; clauses]
  (<span style="color: #a020f0;">if</span> (empty? var-vec)
    `(lconj+ ~@clauses)
    `(call-fresh (<span style="color: #a020f0;">fn</span> [~(first var-vec)]
                   (fresh [~@(rest var-vec)]
                     ~@clauses)))))
</pre>
</div>

<p>
A utility to invoke a goal with an empty state, as you might do
when running a logic program from scratch:
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">call-empty-state</span> [goal]
  (goal empty-state))
</pre>
</div>

<p>
Finally, the run* macro gives us a lazy sequence of readable (reified) values.
</p>
<div class="org-src-container">

<pre class="src src-clojure">&gt; (run* [q]
    (conde
      [(=== q 1)]
      [(=== q 7)]))
(1 7)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">run*</span> [fresh-var-vec &amp; goals]
  `(<span style="color: #a020f0;">-&gt;&gt;</span> (fresh [~@fresh-var-vec] ~@goals)
     call-empty-state
     stream-to-seq
     (map reify-state-first-var)))
</pre>
</div>

<p>
If you only want a few values (for example, if you know there are an
infinite number of results), (run n [q] <a id="goals" name="goals"></a>) can do that. It's
equivalent to running <code>take</code> on the output of run*.
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">run</span> [n fresh-var-vec &amp; goals]
  `(take ~n (run* ~fresh-var-vec ~@goals)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Sequences</h2>
<div class="outline-text-2" id="text-4">
<p>
The base logic programming system has unification and reification
support for only lvars and basic values. But it's done in an
extensible way. We'll now proceed to add sequence support to the base
language.
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Extending the core</h3>
<div class="outline-text-3" id="text-4-1">
<p>
When we unify sequences, we'd like to be able to indicate that an lvar
should be associated with the tail of a sequence. In the scheme
implementation, this is easy: by placing an lvar in the tail position
of a linked list node (the cdr position of a cons node), the
unification happens naturally when walking down the list.
</p>

<p>
Since Clojure disallows putting non-list items in linked-list cells
(so-called 'improper lists'), we have to find another way to do
it. core.logic solves this problem by defining its own LCons data type
which does allow improper lists. We take a different approach here.
</p>

<p>
Whenver you want an improper list in the context of a logic program,
you can signify it with the 'dot' sigil. For example: <code>[1 2 dot a]</code>.
This is meant to evoke the Scheme and Common LISP notation for
improper lists: <code>(1 2 . 3)</code>. This will typically be transparent to the
user on the programming side, since such lists will be automatically
constructed by the 'conso' goal below.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">deftype</span> <span style="color: #228b22;">Dot</span> [])
(<span style="color: #a020f0;">def</span> <span style="color: #a0522d;">dot</span> (<span style="color: #228b22;">Dot.</span>))
</pre>
</div>

<p>
There are times when the user may see an improper list as the result
of a query. In this case, print the sigil as "."
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">print-method</span> <span style="color: #228b22;">Dot</span> [l ^<span style="color: #228b22;">java.io.Writer</span> w]
  (<span style="color: #483d8b;">.write</span> w <span style="color: #8b2252;">"."</span>))
</pre>
</div>

<p>
The first extension point is the unifier; we need to define what it means
to unify a sequence with something else.
</p>

<p>
The basic case is simple: if unifying a sequence with another sequence,
then we should unify each element together. Recursively, this means unifying
their first elements and then the rest of the sequence.
</p>

<p>
The unifier also needs to be aware of the dot-notation described
above. If either <i>u</i> or <i>v</i> is a sequence beginning with a dot, the
its second item must be an lvar which should be unified with the other
variable. For example, if we start with <code>(=== [1 2 3] [1 . a])</code>, it
will recurse down to <code>(=== [2 3] [. a])</code>. Detecting that, we can call
<code>(=== [2 3] a)</code>, which gives the desired result.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(extend-protocol <span style="color: #228b22;">IUnifyTerms</span>
  <span style="color: #228b22;">clojure.lang.Sequential</span>
  (unify-terms [u v s]
    (<span style="color: #a020f0;">cond</span>
      (= dot (first u)) (unify (second u) v s)
      (= dot (first v)) (unify u (second v) s)
      (seq v) (<span style="color: #a020f0;">-&gt;&gt;</span> s
                (unify (first u) (first v))
                (unify (rest u) (rest v))))))
</pre>
</div>

<p>
Next, we need to extend the reifier. When calling reify-s, we need to
look for occurences of logic variables inside of given paramter. This
extends reify-s to make a recursive call on the first element of the
sequence, then on the remaining elements.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(extend-protocol <span style="color: #228b22;">IReifySubstitution</span>
  <span style="color: #228b22;">clojure.lang.Sequential</span>
  (reify-s* [v s-map]
    (<span style="color: #a020f0;">if</span> (seq v)
      (reify-s (rest v) (reify-s (first v) s-map))
      s-map)))
</pre>
</div>

<p>
Deep-walk needs to be extended as well. As above, we we handle
sequences beginning with 'dot' as a special case, go recursing back
with the second item of the sequence.  For any other sequences, we
effectively map the deep-walk function over the sequence.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(extend-protocol <span style="color: #228b22;">IDeepWalk</span>
  <span style="color: #228b22;">clojure.lang.Sequential</span>
  (deep-walk* [v s-map]
    (<span style="color: #a020f0;">cond</span>
      (<span style="color: #a020f0;">and</span> (= dot (first v))
           (sequential? (second v)))
      (deep-walk (second v) s-map)

      (seq v)
      (cons (deep-walk (first v) s-map)
            (deep-walk (rest v)  s-map))

      <span style="color: #008b8b;">:default</span> v)))
</pre>
</div>
</div>
</div>
