literate.org
** Sequence relations
Now we can define some user-level relations for sequences. First,
conso says that /out/ is the sequence with the head /first/ and the
tail /rest/.

#+begin_src clojure :tangle "src/micro_logic/sequence.clj" :comments org
  (defn conso [first rest out]
    (if (lvar? rest)
      (=== [first dot rest] out)
      (=== (cons first rest) out)))
#+end_src

/firsto/ simply says that /first/ is the head of /out/.

#+begin_src clojure :tangle "src/micro_logic/sequence.clj" :comments org
  (defn firsto [first out]
    (fresh [rest]
      (conso first rest out)))
#+end_src

And /resto/, likewise, says that /rest/ is the tail of /out/.

#+begin_src clojure :tangle "src/micro_logic/sequence.clj" :comments org
  (defn resto [rest out]
    (fresh [first]
      (conso first rest out)))
#+end_src

/emptyo/ is a way to say that /s/ must be an empty sequence.

#+begin_src clojure :tangle "src/micro_logic/sequence.clj" :comments org
  (defn emptyo [s]
    (=== '() s))
#+end_src

/appendo/ says that /out/ is the result of appending the sequence parameters
/seq1/ and /seq1/.
#+begin_src clojure :tangle "src/micro_logic/sequence.clj" :comments org
  (defn appendo [seq1 seq2 out]
    (conde
      [(emptyo seq1) (=== seq2 out)]
      [(fresh [first rest rec]
         (conso first rest seq1)
         (conso first rec out)
         (appendo rest seq2 rec))]))
#+end_src

You can do some interesting things with /appendo/. For example, this program
will find all the ways you can append two lists to create ~[1 2 3 4 5]~:

#+begin_src clojure
  > (run* [q]
      (fresh [x y]
        (appendo x y [1 2 3 4 5])
        (=== q [x y])))

  ((() (1 2 3 4 5))
   ((1)  (2 3 4 5))
   ((1 2)  (3 4 5))
   ((1 2 3)  (4 5))
   ((1 2 3 4)  (5))
   ((1 2 3 4 5) ()))
#+end_src

* Back matter
** Bibliography
- The microKanren paper: http://webyrd.net/scheme-2013/papers/HemannMuKanren2013.pdf
- The microKanren scheme implementation: https://github.com/jasonhemann/microKanren
- core.logic, Clojure's real miniKanren implementation: https://github.com/clojure/core.logic
- Will Byrd's dissertation on miniKanren: https://github.com/webyrd/dissertation-single-spaced/raw/master/thesis.pdf
- Chris Grand on the lazy stream monad, and mplus in particular: http://clj-me.cgrand.net/2012/01/30/the-reasoned-scheduler/
- The Reasoned Schemer: http://mitpress.mit.edu/books/reasoned-schemer

** Differences from microKanren
Polymorphic dispatch via protocols is used in place of `(cond)` with
type checks, where possible.

Clojure-native datatypes are used where appropriate
- The substitution map is a clojure map instead of an alist
- There is an LVar defrecrord, instead of using a vector of c
- We have an explicit StreamNode data type, rather building on the
  built-in list type
- Clojure doesn't allow improper lists; we emulate it with the 'dot'
  sigil.

Many names have changed to be more clojure-like:

|uKanren | microLogic          |
|--------|---------------------|
|mplus   | merge-streams       |
|bind    | mapcat-stream       |
|pull    | realize-stream-head |
|mzero   | empty-stream        |
|unit    | stream              |
|Zzz     | delay-goal          |
|conj    | lconj               |
|disj    | ldisj               |
|==      | =====               |

** Differences from core.logic

|core.logic | microLogic           |
|-----------|----------------------|
|mplus      | merge-streams        |
|bind       | mapcat-stream        |
|pull       | realize-stream-head  |
|mzero      | empty-stream         |
|unit       | stream               |
|==         | =====                |
