literate.html

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Sequence relations</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Now we can define some user-level relations for sequences. First,
conso says that <i>out</i> is the sequence with the head <i>first</i> and the
tail <i>rest</i>.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">conso</span> [first rest out]
  (<span style="color: #a020f0;">if</span> (lvar? rest)
    (=== [first dot rest] out)
    (=== (cons first rest) out)))
</pre>
</div>

<p>
<i>firsto</i> simply says that <i>first</i> is the head of <i>out</i>.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">firsto</span> [first out]
  (fresh [rest]
    (conso first rest out)))
</pre>
</div>

<p>
And <i>resto</i>, likewise, says that <i>rest</i> is the tail of <i>out</i>.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">resto</span> [rest out]
  (fresh [first]
    (conso first rest out)))
</pre>
</div>

<p>
<i>emptyo</i> is a way to say that <i>s</i> must be an empty sequence.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">emptyo</span> [s]
  (=== '() s))
</pre>
</div>

<p>
<i>appendo</i> says that <i>out</i> is the result of appending the sequence parameters
<i>seq1</i> and <i>seq1</i>.
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">appendo</span> [seq1 seq2 out]
  (conde
    [(emptyo seq1) (=== seq2 out)]
    [(fresh [first rest rec]
       (conso first rest seq1)
       (conso first rec out)
       (appendo rest seq2 rec))]))
</pre>
</div>

<p>
You can do some interesting things with <i>appendo</i>. For example, this program
will find all the ways you can append two lists to create <code>[1 2 3 4 5]</code>:
</p>

<div class="org-src-container">

<pre class="src src-clojure">&gt; (run* [q]
    (fresh [x y]
      (appendo x y [1 2 3 4 5])
      (=== q [x y])))

((() (1 2 3 4 5))
 ((1)  (2 3 4 5))
 ((1 2)  (3 4 5))
 ((1 2 3)  (4 5))
 ((1 2 3 4)  (5))
 ((1 2 3 4 5) ()))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Back matter</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Bibliography</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>The microKanren paper: <a href="http://webyrd.net/scheme-2013/papers/HemannMuKanren2013.pdf">http://webyrd.net/scheme-2013/papers/HemannMuKanren2013.pdf</a>
</li>
<li>The microKanren scheme implementation: <a href="https://github.com/jasonhemann/microKanren">https://github.com/jasonhemann/microKanren</a>
</li>
<li>core.logic, Clojure's real miniKanren implementation: <a href="https://github.com/clojure/core.logic">https://github.com/clojure/core.logic</a>
</li>
<li>Will Byrd's dissertation on miniKanren: <a href="https://github.com/webyrd/dissertation-single-spaced/raw/master/thesis.pdf">https://github.com/webyrd/dissertation-single-spaced/raw/master/thesis.pdf</a>
</li>
<li>Chris Grand on the lazy stream monad, and mplus in particular: <a href="http://clj-me.cgrand.net/2012/01/30/the-reasoned-scheduler/">http://clj-me.cgrand.net/2012/01/30/the-reasoned-scheduler/</a>
</li>
<li>The Reasoned Schemer: <a href="http://mitpress.mit.edu/books/reasoned-schemer">http://mitpress.mit.edu/books/reasoned-schemer</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Differences from microKanren</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Polymorphic dispatch via protocols is used in place of `(cond)` with
type checks, where possible.
</p>

<p>
Clojure-native datatypes are used where appropriate
</p>
<ul class="org-ul">
<li>The substitution map is a clojure map instead of an alist
</li>
<li>There is an LVar defrecrord, instead of using a vector of c
</li>
<li>We have an explicit StreamNode data type, rather building on the
built-in list type
</li>
<li>Clojure doesn't allow improper lists; we emulate it with the 'dot'
sigil.
</li>
</ul>

<p>
Many names have changed to be more clojure-like:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">uKanren</th>
<th scope="col" class="left">microLogic</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">mplus</td>
<td class="left">merge-streams</td>
</tr>

<tr>
<td class="left">bind</td>
<td class="left">mapcat-stream</td>
</tr>

<tr>
<td class="left">pull</td>
<td class="left">realize-stream-head</td>
</tr>

<tr>
<td class="left">mzero</td>
<td class="left">empty-stream</td>
</tr>

<tr>
<td class="left">unit</td>
<td class="left">stream</td>
</tr>

<tr>
<td class="left">Zzz</td>
<td class="left">delay-goal</td>
</tr>

<tr>
<td class="left">conj</td>
<td class="left">lconj</td>
</tr>

<tr>
<td class="left">disj</td>
<td class="left">ldisj</td>
</tr>

<tr>
<td class="left">==</td>
<td class="left"><code>===</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Differences from core.logic</h3>
<div class="outline-text-3" id="text-5-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">core.logic</th>
<th scope="col" class="left">microLogic</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">mplus</td>
<td class="left">merge-streams</td>
</tr>

<tr>
<td class="left">bind</td>
<td class="left">mapcat-stream</td>
</tr>

<tr>
<td class="left">pull</td>
<td class="left">realize-stream-head</td>
</tr>

<tr>
<td class="left">mzero</td>
<td class="left">empty-stream</td>
</tr>

<tr>
<td class="left">unit</td>
<td class="left">stream</td>
</tr>

<tr>
<td class="left">==</td>
<td class="left"><code>===</code></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Russell Mull</p>
<p class="date">Created: 2014-12-30 Tue 10:36</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
